infoIHT_BotLab = (
    "🌐 IHT BotLab — это твой старт в мир программирования! 🤖\n\n"

    "Клуб <b>IHT BotLab</b> — это лаборатория, где студенты изучают основы программирования и разработки Telegram-ботов. "
    "Это не только место для обучения, но и пространство для творчества, где идеи превращаются в полезные IT-проекты.\n\n"

    "📅 <i>Формат встреч</i>\n"
    "Периодичность: раз в две недели (в Субботу в 13:50)\n"
    "Длительность: 40 минут\n"
    "20 минут теории 📖\n"
    "20 минут практики 🛠️\n\n"

    "🛠️ <i>Чему научат в клубе?</i>\n"
    "• Работа с Telegram API — как взаимодействовать с платформой и управлять ботами.\n"
    "• Программирование на Python — освоение основ кода.\n"
    "• Управление данными — использование JSON для хранения и обработки данных.\n"
    "• Создание интерфейсов — кнопки, меню, взаимодействие с пользователями.\n"
    "• Работа с медиа — добавление фото, видео и документов в боты.\n"
    "• Хостинг проектов — развертывание ботов на бесплатных серверах.\n\n"

    "👩‍💻 <i>Для кого клуб?</i>\n"
    "• Для новичков, желающих начать изучать программирование 💻\n"
    "• Для тех, кто уже знаком с основами Python и хочет создавать свои проекты ⚙️\n"
    "• Для всех, кто увлекается технологиями и хочет решать реальные задачи 💡\n\n"

    "📲 <b>Как записаться?</b> Регистрация через наш официальный бот: 👉 @iht_botlab_bot\n\n"

    "Стань частью <b>IHT BotLab</b> и открой для себя мир программирования Telegram-ботов! 🚀"
)


save_user_data_text = (f"Регистрация прошла успешно! 🎉\n"
        "Добро пожаловать в Клуб <b>IHT BotLab</b>! Мы рады видеть вас в нашем сообществе. 😊\n\n"
        "Если у вас возникнут вопросы или потребуется помощь, не стесняйтесь обращаться в администрацию клуба: \n@Komronbek_Admin\n@LenovoFlex14")

save_user_data_text_REG_TEST = (f"Регистрация прошла успешно! 🎉\n"
        "Вы можете отправить заявку на любую из перпечисленных клубов! Чтобы подать заявку в клубы, используйте команду\n/choose_club\n\n"
        "Если у вас возникнут вопросы или потребуется помощь, не стесняйтесь обращаться в администрацию бота: \n@Komronbek_Admin\n@LenovoFlex14")

info_text_message1 = (
"""
💬 Основная задача этого бота — автоматизировать процесс регистрации и подачи заявок на различные клубы и мероприятия, облегчая взаимодействие между учащимися и организаторами.

📌 Основные команды:
/start — регистрация нового пользователя.
/choose_club — выбор и подача заявки на клуб.
/apply_event — выбор и подача заявки на мероприятие.
/infoIHT_BotLab — информация о клубе IHT BotLab.
/infoSpeaking_Club_IHT — информация о Speaking Club IHT.
/infoMedia_and_Design — информация о клубе Media & Design.
/policy — команда, которая отправляет пользователю текст политики конфиденциальности.
""")

info_text_message = (
"""
💬 Основная задача этого бота — автоматизировать процесс регистрации и подачи заявок на различные клубы, облегчая взаимодействие между учащимися и организаторами.

📌 Основные команды:
/start — регистрация нового пользователя.
/choose_club — выбор и подача заявки на клуб.
/infoIHT_BotLab — информация о клубе IHT BotLab.
/policy — команда, которая отправляет пользователю текст политики конфиденциальности.
""")

info_Speaking_Club_IHT = (
    "📢 Приглашаем на Speaking Club IHT! \n\n"
    "🎯 Мечтаете уверенно говорить на английском, улучшить свои навыки общения и провести время с пользой? \n\n"
    "Speaking Club IHT — это место, где: \n\n"
    "✔️ Вы сможете свободно практиковать английский в тёплой и дружелюбной атмосфере. \n"
    "✔️ Интерактивные форматы сделают каждую встречу увлекательной: обсуждения, игры, дебаты и разговоры на актуальные темы. \n"
    "✔️ Лёгкость общения поможет завести новых друзей и узнать много интересного. \n"
    "✔️ Ваши коммуникативные навыки будут расти без напряжения и скуки! \n\n"
    "🌐 Для кого: любой уровень английского — главное, ваше желание участвовать. \n\n"
    "📩 Узнайте о предстоящих сессиях и новостях: \n\n"
    "• [Speaking Club IHT](https://t.me/SpeakingClubIHT) \n"
    "• [Speaking Club IHT group](https://t.me/SpeakingClubIHTGroup) \n\n"
    "💬 Присоединяйтесь и станьте частью нашего вдохновляющего сообщества! \n\n"
    "✨ Начните говорить свободно уже сегодня!"
)


info_Media_and_Design = (
    "🎨 Привет! Набор в клуб Media & Design продолжается! 🚀\n\n"
    "Если вы увлекаетесь графическим дизайном или медиа-контентом, хотите учиться новому и общаться с творческими людьми, добро пожаловать к нам! У нас уютная атмосфера и море вдохновения.\n\n"
    "💡 Что вас ждёт в клубе?\n\n"
    "• Полезные советы и лайфхаки по созданию дизайнов 🎯\n"
    "• Работа с инструментами, такими как Figma, Photoshop, Illustrator 💻\n"
    "• Реальные примеры крутых проектов и идей 🖼\n"
    "• Обсуждение трендов и новинок в мире дизайна 🔥\n"
    "• Возможность встретить единомышленников и работать над совместными проектами 🤝\n\n"
    "📌 Для кого мы?\n\n"
    "• Для новичков и тех, кто уже что-то умеет\n"
    "• Для тех, кто хочет развивать навыки и творить\n\n"
    "✍️ Чтобы вступить, напишите нам в личные сообщения @Alixissecond. Мы рады каждому новому участнику!\n"
    "Наш канал в телеграм - https://t.me/mediadesignihl\n\n"
    "Творите и развивайтесь вместе с Media & Design! 😊"
)

gazeta_ly = (
    "Дорогие учащиеся!❤️\n\n"
    "У вас есть возможность оставить свой творческий след в лицейской газете, отправив нам свою статью. "
    "Вы можете писать о чём угодно в любой форме. Будь то короткое сообщение или длинный продуманный текст. "
    "Поделитесь своими мыслями, впечатлениями от учёбы, в общем, любыми размышлениями, связанными с лицеем.\n\n"

    "Если вы пишете стихотворения или книги, рисуете или занимаетесь другим творчеством, то это прекрасный шанс проявить себя "
    "и дополнить страницы газеты своими работами!👼\n\n"

    "Отправляйте тексты и свои творения в Телеграм: @pollyyal\n\n"

    "*Есть возможность отправить сообщение анонимно по ссылке: t.me/anonimnyye_voprosy_bot?start=kverm"
)

day_6_eco = (
    "🌱Прими участие в уникальном ЭКО проекте\n"
    "«6 ДНЕЙ ЗАГРЯЗНЕНИЯ МИРА»\n\n"

    "🏞 Ежегодный конкурс инсталляций и необычных костюмов на территории нашего лицея, приурочен к годовщине принятия закона "
    "о защите окружающей среды.\n\n"

    "1 этап - эскиз будущей инсталляции, костюма с прописанной идеей и концепцией, слоган команды, нацеленный на защиту окружающей среды.\n\n"

    "2 этап - создание инсталляции, костюма на территории нашего лицея в чётко определённые временные рамки.\n\n"

    "☘ Требования к инсталляции:\n"
    "Размер от 1,5 м - 2,5 м.\n"
    "Допускается использование только материалов, не причиняющих вред окружающей среде.\n\n"

    "☘ Требования к костюму:\n"
    "Костюм может быть как женским, так и мужским.\n"
    "Допускается использование только материалов, не причиняющих вред окружающей среде.\n"
    "Костюм должен быть носибельным и иметь модель, которая сможет его представить.\n\n"

    "📌 Для участия в данном проекте\n"
    "Необходимо собрать команду до 8 учеников и зарегистрироваться.\n\n"

    "Регистрация до 23 ноября.\n\n"

    "Вся дополнительная информация: @Gel_lii"
)

SLEO = (
    "Присоединяйтесь к нашей команде волонтеров SLEO!\n\n"
    "Мы ищем энергичных и отзывчивых ребят, которые хотят внести свой вклад в наш лицей!\n\n"
    "Если вы готовы посвятить своё время и энергию на благое дело, мы с радостью примем вас в нашу команду SLEO.\n\n"

    "Чтобы подать заявку, заполните форму по ссылке:\n"
    "https://forms.gle/3KhLsvDrcTc24asdA\n\n"

    "Дедлайн подачи заявок: 21 ноября, 20:00\n\n"

    "По всем дополнительным вопросам: @Gel_lii, @abdulayevaazi, @khdvkamran\n\n"

    "Не упустите возможность присоединиться к нашей команде и стать частью чего-то особенного.\n"
    "Вместе мы сможем сделать наш лицей лучше!"
)

policy = (f"Политика и конфидентальность\n\n"
          f"https://telegra.ph/Polzovatelskoe-soglashenie-i-Politika-konfidencialnosti-11-24\n\n"
          f"Примечание: Пользовательское соглашение, 1.2")
